// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1
Console.WriteLine("Введите трёхзначное число ");
int N = Convert.ToInt32(Console.ReadLine());
int N2 = N;
int i = 0; // кол-во цифр
while (N2 > 0)
{
    i++;
    N2 = N2 / 10;
}
Console.WriteLine($"Количество цифр введенного числа : {i} ");
if (i == 3)
{
    int N12 = N / 10;
    int N1 = N12 % 10;
    Console.WriteLine($"Искомое число: {N1}");
}
else
{
    Console.WriteLine("Введите трехзначное число");
}